/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
pub struct __BindgenUnionField<T>(::std::marker::PhantomData<T>);
impl<T> __BindgenUnionField<T> {
    #[inline]
    pub const fn new() -> Self {
        __BindgenUnionField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut(&mut self) -> &mut T {
        ::std::mem::transmute(self)
    }
}
impl<T> ::std::default::Default for __BindgenUnionField<T> {
    #[inline]
    fn default() -> Self {
        Self::new()
    }
}
impl<T> ::std::clone::Clone for __BindgenUnionField<T> {
    #[inline]
    fn clone(&self) -> Self {
        *self
    }
}
impl<T> ::std::marker::Copy for __BindgenUnionField<T> {}
impl<T> ::std::fmt::Debug for __BindgenUnionField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__BindgenUnionField")
    }
}
impl<T> ::std::hash::Hash for __BindgenUnionField<T> {
    fn hash<H: ::std::hash::Hasher>(&self, _state: &mut H) {}
}
impl<T> ::std::cmp::PartialEq for __BindgenUnionField<T> {
    fn eq(&self, _other: &__BindgenUnionField<T>) -> bool {
        true
    }
}
impl<T> ::std::cmp::Eq for __BindgenUnionField<T> {}
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type in_addr_t = __uint32_t;
pub type dispatch_queue_t = *mut dispatch_queue_s;
pub type dispatch_queue_global_t = dispatch_queue_t;
#[repr(C)]
pub struct dispatch_queue_s {
    pub _address: u8,
}
unsafe extern "C" {
    pub fn dispatch_get_global_queue(identifier: isize, flags: usize) -> dispatch_queue_global_t;
}
pub type xpc_object_t = *mut ::std::os::raw::c_void;
unsafe extern "C" {
    pub fn xpc_release(object: xpc_object_t);
}
unsafe extern "C" {
    pub fn xpc_bool_create(value: bool) -> xpc_object_t;
}
unsafe extern "C" {
    pub fn xpc_uint64_create(value: u64) -> xpc_object_t;
}
unsafe extern "C" {
    pub fn xpc_dictionary_create(
        keys: *const *const ::std::os::raw::c_char,
        values: *const *mut ::std::os::raw::c_void,
        count: usize,
    ) -> xpc_object_t;
}
unsafe extern "C" {
    pub fn xpc_dictionary_get_uint64(
        xdict: xpc_object_t,
        key: *const ::std::os::raw::c_char,
    ) -> u64;
}
unsafe extern "C" {
    pub fn xpc_dictionary_get_string(
        xdict: xpc_object_t,
        key: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iovec"][::std::mem::size_of::<iovec>() - 16usize];
    ["Alignment of iovec"][::std::mem::align_of::<iovec>() - 8usize];
    ["Offset of field: iovec::iov_base"][::std::mem::offset_of!(iovec, iov_base) - 0usize];
    ["Offset of field: iovec::iov_len"][::std::mem::offset_of!(iovec, iov_len) - 8usize];
};
#[repr(C)]
pub struct in_addr {
    pub s_addr: in_addr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in_addr"][::std::mem::size_of::<in_addr>() - 4usize];
    ["Alignment of in_addr"][::std::mem::align_of::<in_addr>() - 4usize];
    ["Offset of field: in_addr::s_addr"][::std::mem::offset_of!(in_addr, s_addr) - 0usize];
};
#[repr(C)]
pub struct in6_addr {
    pub __u6_addr: in6_addr__bindgen_ty_1,
}
#[repr(C)]
pub struct in6_addr__bindgen_ty_1 {
    pub __u6_addr8: __BindgenUnionField<[__uint8_t; 16usize]>,
    pub __u6_addr16: __BindgenUnionField<[__uint16_t; 8usize]>,
    pub __u6_addr32: __BindgenUnionField<[__uint32_t; 4usize]>,
    pub bindgen_union_field: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in6_addr__bindgen_ty_1"][::std::mem::size_of::<in6_addr__bindgen_ty_1>() - 16usize];
    ["Alignment of in6_addr__bindgen_ty_1"]
        [::std::mem::align_of::<in6_addr__bindgen_ty_1>() - 4usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr8"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr8) - 0usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr16"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr16) - 0usize];
    ["Offset of field: in6_addr__bindgen_ty_1::__u6_addr32"]
        [::std::mem::offset_of!(in6_addr__bindgen_ty_1, __u6_addr32) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of in6_addr"][::std::mem::size_of::<in6_addr>() - 16usize];
    ["Alignment of in6_addr"][::std::mem::align_of::<in6_addr>() - 4usize];
    ["Offset of field: in6_addr::__u6_addr"][::std::mem::offset_of!(in6_addr, __u6_addr) - 0usize];
};
pub type operating_modes_t = u32;
pub const VMNET_HOST_MODE: _bindgen_ty_65 = 1000;
pub const VMNET_SHARED_MODE: _bindgen_ty_65 = 1001;
pub const VMNET_BRIDGED_MODE: _bindgen_ty_65 = 1002;
pub type _bindgen_ty_65 = ::std::os::raw::c_uint;
pub type vmnet_mode_t = operating_modes_t;
pub type interface_event_t = u32;
pub const VMNET_INTERFACE_PACKETS_AVAILABLE: _bindgen_ty_66 = 1;
pub type _bindgen_ty_66 = ::std::os::raw::c_uint;
pub type vmnet_return_t = u32;
pub const VMNET_SUCCESS: _bindgen_ty_67 = 1000;
pub const VMNET_FAILURE: _bindgen_ty_67 = 1001;
pub const VMNET_MEM_FAILURE: _bindgen_ty_67 = 1002;
pub const VMNET_INVALID_ARGUMENT: _bindgen_ty_67 = 1003;
pub const VMNET_SETUP_INCOMPLETE: _bindgen_ty_67 = 1004;
pub const VMNET_INVALID_ACCESS: _bindgen_ty_67 = 1005;
pub const VMNET_PACKET_TOO_BIG: _bindgen_ty_67 = 1006;
pub const VMNET_BUFFER_EXHAUSTED: _bindgen_ty_67 = 1007;
pub const VMNET_TOO_MANY_PACKETS: _bindgen_ty_67 = 1008;
pub const VMNET_SHARING_SERVICE_BUSY: _bindgen_ty_67 = 1009;
pub const VMNET_NOT_AUTHORIZED: _bindgen_ty_67 = 1010;
pub type _bindgen_ty_67 = ::std::os::raw::c_uint;
#[repr(C)]
pub struct vmpktdesc {
    pub vm_pkt_size: usize,
    pub vm_pkt_iov: *mut iovec,
    pub vm_pkt_iovcnt: u32,
    pub vm_flags: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vmpktdesc"][::std::mem::size_of::<vmpktdesc>() - 24usize];
    ["Alignment of vmpktdesc"][::std::mem::align_of::<vmpktdesc>() - 8usize];
    ["Offset of field: vmpktdesc::vm_pkt_size"]
        [::std::mem::offset_of!(vmpktdesc, vm_pkt_size) - 0usize];
    ["Offset of field: vmpktdesc::vm_pkt_iov"]
        [::std::mem::offset_of!(vmpktdesc, vm_pkt_iov) - 8usize];
    ["Offset of field: vmpktdesc::vm_pkt_iovcnt"]
        [::std::mem::offset_of!(vmpktdesc, vm_pkt_iovcnt) - 16usize];
    ["Offset of field: vmpktdesc::vm_flags"][::std::mem::offset_of!(vmpktdesc, vm_flags) - 20usize];
};
#[repr(C)]
pub struct vmnet_interface {
    _unused: [u8; 0],
}
pub type interface_ref = *mut vmnet_interface;
unsafe extern "C" {
    pub static vmnet_operation_mode_key: *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static vmnet_mac_address_key: *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static vmnet_allocate_mac_address_key: *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static vmnet_mtu_key: *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static vmnet_estimated_packets_available_key: *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static vmnet_enable_tso_key: *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static vmnet_enable_checksum_offload_key: *const ::std::os::raw::c_char;
}
pub type vmnet_start_interface_completion_handler_t = *mut ::std::os::raw::c_void;
pub type vmnet_interface_event_callback_t = *mut ::std::os::raw::c_void;
unsafe extern "C" {
    pub fn vmnet_interface_set_event_callback(
        interface: interface_ref,
        event_mask: interface_event_t,
        queue: dispatch_queue_t,
        callback: vmnet_interface_event_callback_t,
    ) -> vmnet_return_t;
}
unsafe extern "C" {
    pub fn vmnet_write(
        interface: interface_ref,
        packets: *mut vmpktdesc,
        pktcnt: *mut ::std::os::raw::c_int,
    ) -> vmnet_return_t;
}
unsafe extern "C" {
    pub fn vmnet_read(
        interface: interface_ref,
        packets: *mut vmpktdesc,
        pktcnt: *mut ::std::os::raw::c_int,
    ) -> vmnet_return_t;
}
pub type vmnet_interface_completion_handler_t = *mut ::std::os::raw::c_void;
unsafe extern "C" {
    pub fn vmnet_stop_interface(
        interface: interface_ref,
        queue: dispatch_queue_t,
        handler: vmnet_interface_completion_handler_t,
    ) -> vmnet_return_t;
}
#[repr(C)]
pub struct vmnet_network {
    _unused: [u8; 0],
}
pub type vmnet_network_ref = *mut vmnet_network;
#[repr(C)]
pub struct vmnet_network_configuration {
    _unused: [u8; 0],
}
pub type vmnet_network_configuration_ref = *mut vmnet_network_configuration;
unsafe extern "C" {
    pub fn vmnet_network_configuration_create(
        mode: vmnet_mode_t,
        status: *mut vmnet_return_t,
    ) -> vmnet_network_configuration_ref;
}
unsafe extern "C" {
    pub fn vmnet_network_create(
        configuration: vmnet_network_configuration_ref,
        status: *mut vmnet_return_t,
    ) -> vmnet_network_ref;
}
unsafe extern "C" {
    pub fn vmnet_interface_start_with_network(
        network: vmnet_network_ref,
        interface_desc: xpc_object_t,
        queue: dispatch_queue_t,
        start_block: vmnet_start_interface_completion_handler_t,
    ) -> interface_ref;
}
unsafe extern "C" {
    pub fn vmnet_network_configuration_disable_nat44(config: vmnet_network_configuration_ref);
}
unsafe extern "C" {
    pub fn vmnet_network_configuration_disable_nat66(config: vmnet_network_configuration_ref);
}
unsafe extern "C" {
    pub fn vmnet_network_configuration_disable_dhcp(config: vmnet_network_configuration_ref);
}
unsafe extern "C" {
    pub fn vmnet_network_configuration_disable_dns_proxy(config: vmnet_network_configuration_ref);
}
unsafe extern "C" {
    pub fn vmnet_network_configuration_disable_router_advertisement(
        config: vmnet_network_configuration_ref,
    );
}
unsafe extern "C" {
    pub fn vmnet_network_configuration_set_ipv4_subnet(
        config: vmnet_network_configuration_ref,
        subnet_addr: *const in_addr,
        subnet_mask: *const in_addr,
    ) -> vmnet_return_t;
}
unsafe extern "C" {
    pub fn vmnet_network_configuration_set_ipv6_prefix(
        config: vmnet_network_configuration_ref,
        prefix: *const in6_addr,
        len: u8,
    ) -> vmnet_return_t;
}
unsafe extern "C" {
    pub fn vmnet_network_configuration_set_mtu(
        config: vmnet_network_configuration_ref,
        mtu: u32,
    ) -> vmnet_return_t;
}
