/* automatically generated by rust-bindgen 0.72.1 */

pub type dispatch_queue_t = *mut dispatch_queue_s;
pub type dispatch_queue_global_t = dispatch_queue_t;
#[repr(C)]
pub struct dispatch_queue_s {
    pub _address: u8,
}
unsafe extern "C" {
    pub fn dispatch_get_global_queue(identifier: isize, flags: usize) -> dispatch_queue_global_t;
}
pub type xpc_object_t = *mut ::std::os::raw::c_void;
unsafe extern "C" {
    pub fn xpc_release(object: xpc_object_t);
}
unsafe extern "C" {
    pub fn xpc_bool_create(value: bool) -> xpc_object_t;
}
unsafe extern "C" {
    pub fn xpc_uint64_create(value: u64) -> xpc_object_t;
}
unsafe extern "C" {
    pub fn xpc_dictionary_create(
        keys: *const *const ::std::os::raw::c_char,
        values: *const *mut ::std::os::raw::c_void,
        count: usize,
    ) -> xpc_object_t;
}
unsafe extern "C" {
    pub fn xpc_dictionary_get_uint64(
        xdict: xpc_object_t,
        key: *const ::std::os::raw::c_char,
    ) -> u64;
}
unsafe extern "C" {
    pub fn xpc_dictionary_get_string(
        xdict: xpc_object_t,
        key: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iovec"][::std::mem::size_of::<iovec>() - 16usize];
    ["Alignment of iovec"][::std::mem::align_of::<iovec>() - 8usize];
    ["Offset of field: iovec::iov_base"][::std::mem::offset_of!(iovec, iov_base) - 0usize];
    ["Offset of field: iovec::iov_len"][::std::mem::offset_of!(iovec, iov_len) - 8usize];
};
pub const VMNET_HOST_MODE: _bindgen_ty_65 = 1000;
pub const VMNET_SHARED_MODE: _bindgen_ty_65 = 1001;
pub const VMNET_BRIDGED_MODE: _bindgen_ty_65 = 1002;
pub type _bindgen_ty_65 = ::std::os::raw::c_uint;
pub type interface_event_t = u32;
pub const VMNET_INTERFACE_PACKETS_AVAILABLE: _bindgen_ty_66 = 1;
pub type _bindgen_ty_66 = ::std::os::raw::c_uint;
pub type vmnet_return_t = u32;
pub const VMNET_SUCCESS: _bindgen_ty_67 = 1000;
pub const VMNET_FAILURE: _bindgen_ty_67 = 1001;
pub const VMNET_MEM_FAILURE: _bindgen_ty_67 = 1002;
pub const VMNET_INVALID_ARGUMENT: _bindgen_ty_67 = 1003;
pub const VMNET_SETUP_INCOMPLETE: _bindgen_ty_67 = 1004;
pub const VMNET_INVALID_ACCESS: _bindgen_ty_67 = 1005;
pub const VMNET_PACKET_TOO_BIG: _bindgen_ty_67 = 1006;
pub const VMNET_BUFFER_EXHAUSTED: _bindgen_ty_67 = 1007;
pub const VMNET_TOO_MANY_PACKETS: _bindgen_ty_67 = 1008;
pub const VMNET_SHARING_SERVICE_BUSY: _bindgen_ty_67 = 1009;
pub const VMNET_NOT_AUTHORIZED: _bindgen_ty_67 = 1010;
pub type _bindgen_ty_67 = ::std::os::raw::c_uint;
#[repr(C)]
pub struct vmpktdesc {
    pub vm_pkt_size: usize,
    pub vm_pkt_iov: *mut iovec,
    pub vm_pkt_iovcnt: u32,
    pub vm_flags: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of vmpktdesc"][::std::mem::size_of::<vmpktdesc>() - 24usize];
    ["Alignment of vmpktdesc"][::std::mem::align_of::<vmpktdesc>() - 8usize];
    ["Offset of field: vmpktdesc::vm_pkt_size"]
        [::std::mem::offset_of!(vmpktdesc, vm_pkt_size) - 0usize];
    ["Offset of field: vmpktdesc::vm_pkt_iov"]
        [::std::mem::offset_of!(vmpktdesc, vm_pkt_iov) - 8usize];
    ["Offset of field: vmpktdesc::vm_pkt_iovcnt"]
        [::std::mem::offset_of!(vmpktdesc, vm_pkt_iovcnt) - 16usize];
    ["Offset of field: vmpktdesc::vm_flags"][::std::mem::offset_of!(vmpktdesc, vm_flags) - 20usize];
};
#[repr(C)]
pub struct vmnet_interface {
    _unused: [u8; 0],
}
pub type interface_ref = *mut vmnet_interface;
unsafe extern "C" {
    pub static vmnet_operation_mode_key: *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static vmnet_mac_address_key: *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static vmnet_allocate_mac_address_key: *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static vmnet_mtu_key: *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static vmnet_estimated_packets_available_key: *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static vmnet_enable_tso_key: *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static vmnet_enable_checksum_offload_key: *const ::std::os::raw::c_char;
}
pub type vmnet_start_interface_completion_handler_t = *mut ::std::os::raw::c_void;
unsafe extern "C" {
    pub fn vmnet_start_interface(
        interface_desc: xpc_object_t,
        queue: dispatch_queue_t,
        handler: vmnet_start_interface_completion_handler_t,
    ) -> interface_ref;
}
pub type vmnet_interface_event_callback_t = *mut ::std::os::raw::c_void;
unsafe extern "C" {
    pub fn vmnet_interface_set_event_callback(
        interface: interface_ref,
        event_mask: interface_event_t,
        queue: dispatch_queue_t,
        callback: vmnet_interface_event_callback_t,
    ) -> vmnet_return_t;
}
unsafe extern "C" {
    pub fn vmnet_write(
        interface: interface_ref,
        packets: *mut vmpktdesc,
        pktcnt: *mut ::std::os::raw::c_int,
    ) -> vmnet_return_t;
}
unsafe extern "C" {
    pub fn vmnet_read(
        interface: interface_ref,
        packets: *mut vmpktdesc,
        pktcnt: *mut ::std::os::raw::c_int,
    ) -> vmnet_return_t;
}
pub type vmnet_interface_completion_handler_t = *mut ::std::os::raw::c_void;
unsafe extern "C" {
    pub fn vmnet_stop_interface(
        interface: interface_ref,
        queue: dispatch_queue_t,
        handler: vmnet_interface_completion_handler_t,
    ) -> vmnet_return_t;
}
